app/controllers/vote_sms_controller.rb

  def index
    @vote_sms = VoteSm.all.group("compaign_name")
---
SELECT "vote_sms".* FROM "vote_sms"  GROUP BY compaign_name

    def set_vote_sm
      @vote_sm = VoteSm.find(params[:id])
---
SELECT  "vote_sms".* FROM "vote_sms"  WHERE "vote_sms"."id" = 303  ORDER BY "vote_sms"."id" ASC LIMIT 1